Core/src/src/Documents/AzRyПередачаИмуществаСотруднику/AzRyПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyПередачаИмуществаСотруднику</name>
  <registerRecords>AccumulationRegister.AzRyПередачаИмуществаСотруднику</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийПередачаИмуществаСотруднику</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>IT</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>HumanResources</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведующийПоСкладу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьЗакупкиСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/AccumulationRegisters/AzRyПередачаИмуществаСотруднику/AzRyПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AzRyПередачаИмуществаСотруднику</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнеоборотныйАктив</name>
    <type>
      <types>CatalogRef.ВнеоборотныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.AzRyВидыОперацийПередачаИмуществаСотруднику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>IT</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>HumanResources</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаведующийПоСкладу</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/src/Enums/AzRyВидыОперацийПередачаИмуществаСотруднику/AzRyВидыОперацийПередачаИмуществаСотруднику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyВидыОперацийПередачаИмуществаСотруднику</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Documents/AzRyПередачаИмуществаСотруднику/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.AzRyПередачаИмуществаСотруднику.Записывать = Истина;
	Для Каждого ТекСтрокаВнеоборотныеАктивы Из ВнеоборотныеАктивы Цикл
		Движение = Движения.AzRyПередачаИмуществаСотруднику.Добавить();
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.AzRyВидыОперацийПередачаИмуществаСотруднику.Передача") Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Иначе 
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		КонецЕсли;		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сотрудник = Сотрудник;
		Движение.ВидОперации = ВидОперации;
		Движение.Склад = Склад;
		Движение.IT = IT;
		Движение.HumanResources = HumanResources;
		Движение.ЗаведующийПоСкладу = ЗаведующийПоСкладу;
		Движение.Количество = 1;
		Движение.Сумма = ТекСтрокаВнеоборотныеАктивы.СтоимостьЗакупкиСНДС;
		Движение.Автор = Автор;
	КонецЦикла;

КонецПроцедуры
